Repository: mbenoukaiss/clapet
Catalog: Clapet/*.lproj/Localizable.strings
Languages: fr

# update-available
source: Update %1$@ available
fr: Mise à jour %1$@ disponible

# update-available-description
source: A new update is available, click on the download link to see the changelog and download it !
fr: Une nouvelle mise à jour est disponible, cliquez sur le lien de téléchargement pour voir les changements et la télécharger !

source: Remind me later
fr: Me le rappeler plus tard

# skip-version
source: Ignore version
fr: Ignorer cette version

# download-version
source: Download
fr: Télécharger

# no-permission-title
source: No permission to manage sleep
fr: Permissions manquantes

# no-permission-content
source: Clapet needs access to the pmset utility to enable and disable sleep. Please follow the configuration instructions on the GitHub page if you want to eliminate pop-ups requesting permissions. You may need to do this again after a new macOS update, as updates can sometimes erase the configuration.
fr: Clapet a besoin d'accéder à l'utilitaire pmset pour activer et désactiver le mode veille. Veuillez suivre les instructions de configuration sur la page GitHub si vous souhaitez éliminer les fenêtres contextuelles demandant des autorisations. Vous pourriez avoir à le refaire après une nouvelle mise à jour de macOS, car les mises à jour peuvent parfois effacer la configuration.

# no-permission-open
source: See instructions
fr: Voir instructions

# clapet-description
source: Clapet is a utility that allows you to disable sleep completely so you can close your mac while on an external display even when on battery
fr: Clapet est un utilitaire qui permet de désactiver complètement la veille afin de fermer le macbook lorsqu'il sur batterie et connecté à un écran externe

# clapet-pmset-description
source: In order to work, the app uses the utility `pmset`. This small program allows to change battery settings like whether sleep is enabled or disabled. However it requires root permissions to be ran. This means that if no changes are made the system will ask for your password each time sleep gets either disabled or enabled which can get annoying.
fr: Afin de fonctionner l'application besoin de l'utilitaire `pmset`. Ce programme permet de changer des paramètres avancés de la batterie comme désactiver la mise en veille. Il nécessite les droits administrateurs pour fonctionner, ce qui signifie signifie que si aucun changement n'est fait le système va demander votre mot de passe à chaque fois que la veille est activée ou désactiver qui peut devenir gênant.

# clapet-no-pmset-description
source: In order to work, the app uses the utility `pmset` which is already configured properly, you can click the button below to finish installing
fr: Afin de fonctionner l'application besoin de l'utilitaire `pmset` qui est déjà configuré correctement, vous pouvez cliquez sur le bouton ci-dessous pour terminer l'installation

# detailed-pmset-explanation
source: Clicking on the "Click to configure `pmset` and proceed" button will add `/usr/bin/pmset` to the sudoers file with the NOPASSWD configuration so it can be ran without asking for your permission each time
fr: Cliquer sur le bouton "Cliquez pour configurer `pmset` et continuer" va ajouter `/usr/bin/pmset` dans le fichier sudoers avec la configuration `NOPASSWD` pour qu'il se lance sans demander la permission à chaque fois

# introduction-launch-startup
source: Launch application on start-up
fr: Lancer l'application au démarrage

# click-proceed
source: Click to proceed
fr: Cliquez pour continuer

# click-skip
source: Skip configuration
fr: Ignorer la configuration

# configure-later
source: You can always configure `pmset` later in the application's advanced settings
fr: Vous pourrez configurer `pmset` plus tard dans les paramètres avancés de l'application

# click-pmset-proceed
source: Click to configure `pmset` and proceed
fr: Cliquez pour configurer `pmset` et continuer

source: Sleep manager
fr: Gestionnaire de veille

source: Automatically handle sleep
fr: Gestion de veille automatique

# sleep-status-enabled
source: Sleep currently enabled
fr: Veille actuellement activée

# sleep-status-disabled
source: Sleep currently disabled
fr: Veille actuellement désactivée

# sleep-status-disabled-until
source: Sleep disabled until %1$@
fr: Veille désactivée jusqu'à %1$@

source: Disable sleep
fr: Désactiver la veille

source: For 1 minute
fr: Pendant 1 minute

# for-x-minutes
source: For %1$d minutes
fr: Pendant %1$d minutes

source: For 1 hour
fr: Pendant 1 heure

# for-x-hours
source: For %1$d hours
fr: Pendant %1$d heures

# for-hour-minute
source: For 1:01 hour
fr: Pendant 1:01 heure

# for-hour-minutes
source: For 1:%1$d hour
fr: Pendant 1:%1$d heure

# for-hours-minute
source: For %1$d:01 hours
fr: Pendant %1$d:01 heures

# for-hours-minutes
source: For %1$d:%2$d hours
fr: Pendant %1$d:%2$d heures

# unknown-duration
source: Unknown time
fr: Durée inconnue

source: Until enabled
fr: Jusqu'à réactivation

source: Enable sleep
fr: Activer la veille

source: Sleep now
fr: Mettre en veille

source: Settings
fr: Paramètres

source: Quit
fr: Quitter

source: Sleep mode change
fr: Changement de mode

# automatically-enabled-sleep
source: No external display is connected, sleep has been enabled
fr: La veille a été activée car aucun écran externe n'est détecté

# automatically-disabled-sleep
source: An external display has been detected, sleep is now disabled
fr: La veille a été désactivée car un écran externe est détecté

# enable-sleep-soon
source: About to enable sleep
fr: Veille bientôt activée

# sleep-enabled-in
source: Sleep will be enabled in %1$d seconds
fr: La veille va être réactivée dans %1$d secondes

# sleep-enabled-in-automatic
source: Sleep will be enabled in %1$d seconds if no external display is detected
fr: La veille va être réactivée dans %1$d secondes si aucun écran externe n'est connecté

source: General
fr: Général

# deactivation-durations
source: Durations
fr: Durées

source: Shortcuts
fr: Raccourcis

source: Advanced
fr: Avancé

source: Behavior
fr: Comportement

source: Launch at login
fr: Lancer au démarrage

# menu-bar-icon
source: Show menu bar icon
fr: Icone dans la barre de menu

# dock-icon
source: Show dock icon
fr: Icone dans le dock

source: Check for updates
fr: Vérifier les mises à jour

# check-for-updates-description
source: Checks for available updates every week and on application launch
fr: Vérifie si il y a des mises à jour disponibles chaque semaine et au lancement de l'application

source: Inactivity
fr: Inactivité

source: Enable inactivity delay
fr: Activer la sécurité d'inactivité

# inactivity-delay-description
source: After %1$d minutes of inactivity, sleep will be automatically enabled again to preserve battery
fr: Après %1$d minutes d'inactivité, la veille sera automatiquement réactivée pour préserver la batterie

# closed-lid-force-sleep
source: Sleep on reactivation
fr: Mise en veille après réactivation

# closed-lid-force-sleep-description
source: Forces the computer to go to sleep when sleep gets reenabled and the lid is closed. By default the computer stays running until the lid is opened and closed again, the computer is put to sleep manually or due to inactivity.
fr: Force l'ordinateur à se mettre en veille lorsque qu'elle est réactivée et que le capot est fermé. Par défaut l'ordinateur reste allumé jusqu'à ce que le capot soit ouvert puis refermé, que la veille soit activée manuellement ou par inactivité

# double-click-edit
source: Double click on a cell to edit the value. Duration must be a whole number in minutes.
fr: Double-cliquez sur une cellule pour modifier sa valeur. La durée doit être un nombre entier en minutes.

source: Empty
fr: Vide

source: Add row
fr: Ajouter une ligne

source: Label
fr: Nom

source: Duration
fr: Durée

source: Remove row
fr: Retirer la ligne

# click-remove-row
source: Click to remove row
fr: Cliquez pour retirer la ligne

source: Invalid input
fr: Donnée invalide

source: Cancel
fr: Annuler

# error-one-minute
source: Duration must be at least one minute
fr: La durée doit être d'au moins 1 minute

# error-label-already-exists
source: Label "%1$@" already exists
fr: Une ligne avec le nom "%1$@" existe déjà

# error-duration-already-exists
source: Duration "%1$@" already exists
fr: La durée "%1$@" existe déjà

# enable-sleep-shortcut
source: Enable sleep
fr: Activer la veille

# enable-shortcut-description
source: Global shortcut to manually enable sleep
fr: Raccourci global pour réautoriser l'ordinateur à se mettre en veille

# disable-sleep-shortcut
source: Disable sleep
fr: Désactiver la veille

# disable-shortcut-description
source: Global shortcut to forbide the computer to go to sleep until sleep is activated either manually or automatically
fr: Raccourci global pour interdir à l'ordinateur de se mettre en veille jusqu'à réactivation manuelle ou automatique de la veille

# sleep-now-shortcut
source: Sleep now
fr: Mettre en veille

# sleep-now-shortcut-description
source: Global shortcut to put the computer to sleep even when disabled. Prefer this instead of the regular MacOS sleep button/shortcut.
fr: Raccourci global pour mettre l'ordinateur en veille même si elle est désactivée. Préférez ceci au bouton/raccourci de mise en veille natif de MacOS.

# automatic-notifications
source: Notifications upon sleep status change in automatic mode
fr: Envoi de notifications lors du changement de statut de veille en mode automatique

source: Configure `pmset`
fr: Configurer `pmset`

# pmset-already-configured
source: The utility `pmset` is already configured properly
fr: L'utilitaire `pmset` est déjà configuré correctement

# pmset-configure-tooltip
source: By default `pmset` requires your password each time you run it which can get annoying, clicking this button will configure `pmset` to work without password
fr: Par défaut `pmset` demande votre mot de passe à chaque lancement, ce qui peut devenir gênant, cliquez sur ce bouton pour configurer `pmset` et qu'il fonctionne sans mot de passe

# delay-automatic-reactivation
source: Reactivation delay
fr: Délai de réactivation

# delay-automatic-reactivation-description
source: The delay in seconds before sleep gets reactivated when all external displays get unplugged, only applied in automatic mode
fr: Délai en secondes avant que la veille soit réactivée lorsque tous les écrans sont débranchés, uniquement en mode automatique

source: Reset settings
fr: Réinitialiser les paramètres

# reset-settings-description
source: Reset all the application settings excluding configuration changes to `pmset`
fr: Réinitialise tous les paramètres de l'application à part les changements faits à `pmset`
